# Set up a sqlite database

In [1]:
import sqlite3

In [2]:
sqlite3.connect("hdb_resale") #your db name

# Quick peek at data

In [6]:
import pandas as pd

In [8]:
df = pd.read_excel("./data/raw/HDB_Resale_Flat_Sengkang_11_2023.xlsx")
df.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,2023-11,SENGKANG,2 ROOM,453A,FERNVALE RD,19 TO 21,46,2-room,2015,90,332000
1,2023-11,SENGKANG,2 ROOM,453A,FERNVALE RD,13 TO 15,46,Model A,2015,90,340000
2,2023-11,SENGKANG,2 ROOM,443C,FERNVALE RD,04 TO 06,47,Model A,2012,88,335000
3,2023-11,SENGKANG,2 ROOM,180B,RIVERVALE CRES,04 TO 06,47,Model A,2015,90,338000
4,2023-11,SENGKANG,3 ROOM,334A,ANCHORVALE CRES,10 TO 12,67,Premium Apartment,2015,91,470000

# Import data

<b>Convert data from excel to csv</b>

In [4]:
from conversions import export_excel_work_book_sheet_to_csv

In [10]:
export_excel_work_book_sheet_to_csv("./data/raw/HDB_Resale_Flat_Sengkang_11_2023.xlsx",
                                    "Sheet1",
                                    "./data/interim/HDB_Resale_Flat_Sengkang_11_2023.csv"
                                   )

Excel Workbook: ./data/raw/HDB_Resale_Flat_Sengkang_11_2023.xlsx

Work Sheet: Sheet1

Number of Columns: 11

Number of Rows: 149

Extracting Work Sheet Sheet1 to ./data/interim/HDB_Resale_Flat_Sengkang_11_2023.csv

In [11]:
conn = sqlite3.connect("sengkang_resale_nov_23") # what's your dataset about
c = conn.cursor()

In [14]:
c.execute('''
    CREATE TABLE IF NOT EXISTS sengkang_resale_nov_23
    (month TEXT,
    town TEXT,
    flat_type TEXT,
    block TEXT,
    street_name TEXT,
    storey_range TEXT,
    floor_area_sqm TEXT,
    flat_model TEXT,
    lease_commence_date TEXT,
    remaining_lease TEXT,
    resale_price TEXT
    )
''')

In [15]:
# Test run some data

In [16]:
c.execute('''
    INSERT INTO sengkang_resale_nov_23(month, town, flat_type, block, street_name, storey_range, floor_area_sqm, flat_model, lease_commence_date, remaining_lease, resale_price)
    VALUES("2023-12", "SENGKANG", "4 ROOM", "124A", "RIVERVALE DRIVE", "04 TO 06", "87", "Model A", "2015", "90", "680000")
''')
conn.commit()

In [5]:
import pandas as pd

In [17]:
pd.read_sql_query("SELECT * from sengkang_resale_nov_23", conn)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,2023-12,SENGKANG,4 ROOM,124A,RIVERVALE DRIVE,04 TO 06,87,Model A,2015,90,680000

In [18]:
c.execute("SELECT * FROM sengkang_resale_nov_23")
rows = c.fetchall()
rows

[('2023-12',
  'SENGKANG',
  '4 ROOM',
  '124A',
  'RIVERVALE DRIVE',
  '04 TO 06',
  '87',
  'Model A',
  '2015',
  '90',
  '680000')]